In [1]:
import pandas as pd

In [2]:
df=pd.DataFrame({'M1':[4,5,1],'M2':[4,4,2],'M3':[2,1,5]},index=["U1","U2","U3"])

In [3]:
df

    M1  M2  M3
U1   4   4   2
U2   5   4   1
U3   1   2   5

In [5]:
df_movie_corr=df.corr()

In [6]:
df_movie_corr

          M1        M2        M3
M1  1.000000  0.970725 -1.000000
M2  0.970725  1.000000 -0.970725
M3 -1.000000 -0.970725  1.000000

In [7]:
df_movie_corr['M2']

M1    0.970725
M2    1.000000
M3   -0.970725
Name: M2, dtype: float64

In [8]:
choosenMovie=df_movie_corr.M2

In [9]:
df_movie_corr.corrwith(choosenMovie)

M1    0.999669
M2    1.000000
M3   -0.999669
dtype: float64

In [10]:
df

    M1  M2  M3
U1   4   4   2
U2   5   4   1
U3   1   2   5

In [11]:
from sklearn.metrics.pairwise import cosine_similarity

In [13]:
df=pd.DataFrame({'M1':[4,5,1],'M2':[4,4,2],'M3':[2,1,5],"M4":[1,1,3]},index=["U1","U2","U3"])

In [14]:
df

    M1  M2  M3  M4
U1   4   4   2   1
U2   5   4   1   1
U3   1   2   5   3

In [15]:
cosine_similarity(df)

array([[1.        , 0.97775381, 0.65812266],
       [0.97775381, 1.        , 0.51280561],
       [0.65812266, 0.51280561, 1.        ]])

In [17]:
pd.DataFrame(cosine_similarity(df.T),columns=df.columns,index=df.columns)

          M1        M2        M3        M4
M1  1.000000  0.977255  0.507093  0.558291
M2  0.977255  1.000000  0.669439  0.703526
M3  0.507093  0.669439  1.000000  0.990867
M4  0.558291  0.703526  0.990867  1.000000

In [18]:
df

    M1  M2  M3  M4
U1   4   4   2   1
U2   5   4   1   1
U3   1   2   5   3

In [19]:
df.T

    U1  U2  U3
M1   4   5   1
M2   4   4   2
M3   2   1   5
M4   1   1   3